package com.cheshuina_antonova.student_planner_isp_231.data

data class Lesson(
    val id: String,
    val day: String,
    val time: String,
    val name: String,
    val room: String,
    val professor: String
)

// Расписание на неделю
val raspisanieList = listOf(
    // Понедельник
    Lesson("1", "Понедельник", "08:30-10:00", "Разработка мобильных приложений", "1-02", "Леонтьев Д.А."),
    Lesson("2", "Понедельник", "10:10-11:40", "Разработка мобильных приложений", "1-02", "Леонтьев Д.А."),

    // Вторник
    Lesson("3", "Вторник", "10:10-11:40", "Английский язык", "2-22", "Пенькова О.В."),
    Lesson("4", "Вторник", "12:10-13:40", "Физическая культура", "спортзал", "Магомедов С.К"),

    // Среда
    Lesson("5", "Среда", "13:50-15:20", "Системное программирование", "3-03", "Токаев Т.И."),
    Lesson("6", "Среда", "15:30-17:00", "Системное программирование", "3-03", "Токаев Т.И."),

    // Четверг
    Lesson("7", "Четверг", "08:30-10:00", "Математическое моделирование", "3-29", "Трошина О.В."),
    Lesson("8", "Четверг", "10:10-11:40", "Менеджмент в профессиольной деятельности", "3-02", "Запорожская С.А."),

    // Пятница
    Lesson("9", "Пятница", "13:40-15:20", "Разработка программных модулей", "3-12", "Донскова Д.А."),
    Lesson("10", "Пятница", "15:30-17:00", "Обеспечение качества функционирования компьютерных систем", "3-12", "Ушакова М.А.")
)